{
    "persoal_data": {
        "full_name": "Rizky Adi",
        "title": "AI Engineer",
        "image": "./assets/images/profile.jpg",
        "email_disguise": "rizkyzadadi[at]gmail[dot]com",
        "email": "rizkyzadadi@gmail.com",
        "location": "Bogor, Indonesia",
        "social_media": [
            {
                "name": "LinkedIn",
                "ion_icon": "logo-linkedin",
                "url": "https://www.linkedin.com/in/rizky-adi-7b008920b/"
            },
            {
                "name": "GitHub",
                "ion_icon": "logo-github",
                "url": "https://github.com/adirizq"
            }
        ]
    },
    "about_me_page": {
        "description": "I am an aspiring AI engineer and informatics engineering student at Politeknik Negeri Jakarta. My passion lies in developing and researching cutting-edge machine learning solutions. I am a certified TensorFlow Developer and have a proven track record of building end-to-end models, leveraging expertise in PyTorch, TensorFlow, Scikit-learn, and other relevant libraries.  My project experience spans image classification and object detection, text classification and generation, and Retrieval Augmented Generation (RAG) systems. I am also proficient in web development, using Flask, FastAPI, and Laravel.",
        "skills": [
            {
                "name": "AI Engineering",
                "svg_icon": "./assets/images/icon/icon-ai-eng.svg",
                "description": "End-to-end AI model development to deployment, mainly Natural Language Processing and Computer Vision."
            },
            {
                "name": "Web Development",
                "svg_icon": "./assets/images/icon/icon-web-dev.svg",
                "description": "Building deployment ready web applications using Flask, FastAPI, and Laravel."
            }
        ],
        "testimonials": [
            {
                "name": "Annisha Smarananda",
                "date": "April 20, 2024",
                "image": "./assets/images/testimonials/annisha.jpeg",
                "description": "Rizky Adi is one of our internship software developers at PT Nawastra Teknologi Nimpuna. Adi has an introverted type, but very proactive in his role. He helped our programmers a lot during 3 months. According to his manager. He always carries out all tasks very neatly, carefully and in detail. Especially the logic coding is very good! Thank you for everything Adi. I recommend Adi to fill the position of software engineer, especially in the field of machine learning and python programming."
            }
        ],
        "past_companies": [
            {
                "name": "Sakubi Teknologi Indonesia",
                "image": "./assets/images/companies/sakubi-teknologi-indonesia.png",
                "url": "https://sakubi.id/"
            },
            {
                "name": "PT Indovickers Furnitama",
                "image": "./assets/images/companies/pt-indovickers-furnitama.png",
                "url": "https://indovickers.com/"
            },
            {
                "name": "PT Nawastra Teknologi Nimpuna",
                "image": "./assets/images/companies/pt-nawastra.png",
                "url": "https://nawastratechnology.com/"
            },
            {
                "name": "Shortlyst AI",
                "image": "./assets/images/companies/shortlyst.png",
                "url": "https://www.shortlyst.ai/"
            }
        ]
    },
    "resume_page": {
        "experiences": [
            {
                "position": "Data Scientis Intern",
                "company": "Shortlyst AI",
                "date": "July 2024 - September 2024",
                "description": [
                    "Delivered 5+ custom social media data analysis decks, leveraging data visualization to uncover actionable insights. Key areas included conversation volume, hourly trends, sentiment & emotion analysis, topic modeling, and more.",
                    "Utilized OpenAI API to streamline text analysis.",
                    "Developed a high-performance topic modeling algorithm (100k+ data in under 10 minutes) using embedding, clustering, and LLM technologies.",
                    "Implemented efficient news scraping (100+ articles in under 5 minutes) combining third-party APIs and automated page scraping.",
                    "Deployed Topic Modeling and News Scraping Algorithm using Docker and RabbitMQ."
                ]
            },
            {
                "position": "Software Engineer Intern",
                "company": "PT Nawastra Teknologi Nimpuna",
                "date": "January 2024 - April 2024",
                "description": [
                    "Develop Finance Report System with PDF, Word, and Excel Export Feature using Django Framework.",
                    "Guided by Senior Software Engineer to fix bugs and error."
                ]
            },
            {
                "position": "IT Staff Intern",
                "company": "Indovickers Furnitama",
                "date": "September 2023 - December 2023",
                "description": [
                    "Modify Dolibarr as Employee Competency Management System.",
                    "Develop Employee Competency Dashboard using SQL Server Reporting Services (SSRS).",
                    "Direct communication to HR Manager and IT Manager."
                ]
            },
            {
                "position": "Information Technology Part-time Developer",
                "company": "Sakubi Teknoogi Indonesia",
                "date": "March 2022 - June 2023",
                "description": [
                    "Successfully led the development and maintenance of six websites and one Android application, catering to a user base exceeding 1500 individuals.",
                    "Played an integral role within the SAKUBI development team, fostering collaborative efforts to achieve exceptional outcomes in developer projects."
                ]
            }
        ],
        "educations": [
            {
                "degree": "Bachelor of Applied Science in Informatics Engineering",
                "school": "Politeknik Negeri Jakarta",
                "date": "2020 - 2024",
                "description": [
                    "GPA: 3.9/4.0",
                    "Relevant Coursework: Mathematics, Data Structure, Algorithm, Database, Web Programming, Software Engineering, Machine Learning."
                ]
            },
            {
                "degree": "Non-degree in Machine Learning Program",
                "school": "Bangkit Academy led by Google, Tokopedia, Gojek, & Traveloka",
                "date": "February 2023 - July 2023",
                "description": [
                    "Certified TensorFlow Developer by TensorFlow.",
                    "Graduated with distinction (Top 10%).",
                    "Graduated with a 95.49 average score.",
                    "Learned machine learning, soft skills, and English.",
                    "Focusing on TensorFlow as a primary deep learning library.",
                    "Leading capstone project team."
                ]
            },
            {
                "degree": "Non-degree in AI Research Program",
                "school": "BISA AI Academy",
                "date": "August 2022 - December 2022",
                "description": [
                    "Graduated with an 88.18 average scor",
                    "Joining as Artificial Intelligence Research Path.",
                    "Learned all about machine learning and AI research.",
                    "Focusing on Tensorflow as a primary deep learning library."
                ]
            }
        ],
        "certifications": [
            {
                "name": "TensorFlow Developer Certificate",
                "issued_by": "Google",
                "issued_date": "November 2023",
                "expiry_date": "November 2026",
                "url": "https://www.credential.net/75f63ba2-2736-40b0-ac90-3b0a64ede80f"
            },
            {
                "name": "TOEFL iBT (98/120)",
                "issued_by": "ETS",
                "issued_date": "November 2023",
                "expiry_date": "November 2026",
                "url": "https://media.licdn.com/dms/image/D562DAQFvg5GS7iVm2Q/profile-treasury-document-images_800/1/1707488220183?e=1720051200&v=beta&t=HnRNu5bgXwwcyVbVq5DdpPqKNrNr6539aJdu3nXqc-g"
            },
            {
                "name": "TensorFlow: Data and Deployment Specialization",
                "issued_by": "DeepLearning.AI",
                "issued_date": "May 2023",
                "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/PDNN3AP83DAK"
            },
            {
                "name": "DeepLearning.AI TensorFlow Developer Specialization",
                "issued_by": "DeepLearning.AI",
                "issued_date": "April 2023",
                "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/AQGFS9FSZR4J"
            },
            {
                "name": "Machine Learning Specialization",
                "issued_by": "DeepLearning.AI",
                "issued_date": "April 2023",
                "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/K8DADMDXXC5L"
            },
            {
                "name": "Mathematics for Machine Learning Specialization",
                "issued_by": "Imperial College London",
                "issued_date": "March 2023",
                "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/6XANWPLL9ZDD"
            }
        ],
        "tech_stacks": [
            "Python",
            "PyTorch",
            "TensorFlow",
            "Scikit-learn",
            "Hugging Face Transformers",
            "Streamlit",
            "Flask",
            "FastAPI",
            "Docker",
            "PHP",
            "Laravel",
            "SQL"
        ]
    },
    "publication_page": {
        "publications": [
            {
                "status": "Co-author",
                "url": "https://ijeecs.iaescore.com/index.php/IJEECS/article/view/35416",
                "date": "April 2024",
                "title": "Efficient packaging defect detection: leveraging pre-trained vision models through transfer learning",
                "publisher": "The Indonesian Journal of Electrical Engineering and Computer Science (IJEECS)",
                "abstract": "The inspection of packaging defects is a crucial aspect of maintaining the quality of industrial production, especially in the case of boxed products. This study introduces a novel approach for detecting physical defects in product packaging boxes by integrating image processing with deep learning, specifically transfer learning with two images as an input. The proposed method utilizes both top view and side view images of the packaging to determine its condition, a significant departure from the conventional single image input. Our approach incorporates 16 pre-trained model variants from EfficientNetV2, MobileNetV3, and ResNetV2 for transfer learning as feature extractors. The experimental findings demonstrate that the best model that leverages EfficientNetV2 variant achieves 100% accuracy and F1 score in terms of classification performance. However, the most optimal model in terms of classification performance and inference speed was the one that leveraged ResNetV2 variant. This model scored 95% accuracy and 95.24% F1 score, with an inference speed of 91 ms per prediction.",
                "keywords": [
                    "Defect detection",
                    "EfficientNet",
                    "MobileNet",
                    "ResNet",
                    "Transfer learning"
                ]
            },
            {
                "status": "Co-author",
                "url": "https://ieeexplore.ieee.org/document/10443110",
                "date": "February 2024",
                "title": "Diesel Engine Fault Detection using Deep Learning Based on LSTM",
                "publisher": "IEEE Xplore",
                "abstract": "This work aims to create a deep learning model utilizing Long Short-Term Memory (LSTM) as a classification model to detect and diagnose potential problems in diesel engines. The default dataset comprises 3,500 data entries and four distinct dataset types. White noise in the dataset is attributed to additive Gaussian white noise (AWGN). The main contributions of this study comprise developing a classification model aimed at identifying damage in diesel engines, as well as evaluating the performance of the Long Short-Term Memory (LSTM) method. The K-Fold cross-validation technique was utilized, where the value of k was set at 5. This study examines the damage classification in diesel engines using four datasets: default 0dB Noise, 15dB Noise, 30dB Noise, and 60dB Noise. The K-Fold Cross Validation methodology was employed, utilizing a value of k=5. The training and validation processes were conducted iteratively, employing a learning rate of 0.00005 during the training phase. The training phase utilized a mini-batch size of 128, and the maximum number of epochs was set at 10,000. The results indicate that the dataset containing 60dB noise consistently demonstrates the highest level of accuracy, with an average accuracy of 97.91% across the five folds and the efficacy of Long Short-Term Memory (LSTM) models in classification tasks is improved in the presence of white noise.",
                "keywords": [
                    "Cross-Validation",
                    "Diesel Engine",
                    "Deep Learning",
                    "Fault Detection",
                    "Long-Short-Term-Memory"
                ]
            },
            {
                "status": "Co-author",
                "url": "https://www.jatit.org/volumes/Vol102No2/23Vol102No2.pdf",
                "date": "January 2024",
                "title": "Fault Detection in Diesel Engines Using Artificial Neural Networks and Convolutional Neural Networks",
                "publisher": "Journal of Theoretical and Applied Information Technology (JATIT)",
                "abstract": "This research aims to create a deep learning model utilizing Artificial Neural Networks (ANN) and Convolutional Neural Networks (CNN) to detect and classify damage or faults in diesel engines effectively. The main contribution of this study entails the creation of a classification model aimed at problem identification in diesel engines. The study used the DEFault dataset, which has 3,500 rows of data classified into four distinct labels. The DEFault dataset comprises four discrete noise levels, namely 0dB, 15dB, 30dB, and 60 dB. The findings indicate that both models have demonstrated satisfactory outcomes regarding model assessment. The model performance is most ideal when trained on the DEFault dataset with 60dB white noise, whereas the dataset with 0dB white noise leads to the least favourable model performance. The results suggest that artificial neural networks (ANN) perform better than convolutional neural networks (CNN) in datasets with higher levels of white noise. Conversely, CNN demonstrates superior performance in datasets with lower levels of white noise. An additional investigation could prove advantageous in implementing the deep learning model on a device that can identify diesel engine faults in real-time.",
                "keywords": [
                    "Diesel Engine",
                    "Fault Detection",
                    "Deep Learning",
                    "Artificial Neural Network (ANN)",
                    "Convolutional Neural Network (CNN)"
                ]
            },
            {
                "status": "Main Author",
                "url": "https://ieeexplore.ieee.org/document/10381997",
                "date": "January 2024",
                "title": "Tackling an Unbalanced Dataset for Classifying Indonesian E-Commerce Reviews Using Multi Word Embedding Model",
                "publisher": "IEEE Xplore",
                "abstract": "Product reviews are an integral part of ecommerce. By Q2 2020 alone, the average of e-commerce visitors in Indonesia almost reached 400 million. This vast amount of traffic resulting a massive amount of product review information. Product reviews in Indonesia are usually paired with a rating system from one to five based on user satisfaction with the product. Mostly, the number of reviews in each rating is unbalanced. Ratings 5, 4, and 1 are usually more frequent than ratings 2 and 3. This imbalanced data makes classification challenging to categorize the review rating, leading to inaccurate predictions for the rating with fewer data than the others. Previous research used various approaches for classifying review ratings, such as machine learning and fine-tuning a state-of-the-art deep learning model. In this research, we propose a new approach that leverages multiple-word embedding combined with CNN to deal with the highly unbalanced dataset problem. By leveraging multiple-word embedding techniques, the model can extract more features from the review text. We also proposed an extended pipeline to enhance the model performance. The proposed model and pipeline perform better than the fine-tuned Indonesian BERT-based and RoBERTa-based pre-trained models baseline with 0.93 accuracy and 0.82 F1-Macro scores.",
                "keywords": [
                    "Unbalanced Dataset",
                    "Review",
                    "Rating",
                    "Multi Word Embedding",
                    "CNN"
                ]
            },
            {
                "status": "Main Author",
                "url": "https://ieeexplore.ieee.org/document/10331034",
                "date": "September 2023",
                "title": "Fine-Tuning Deep Learning Model for Detecting Indonesian Traffic Accident Tweet",
                "publisher": "IEEE Xplore",
                "abstract": "Twitter is one of Indonesia's most used social media, with total visits reaching 192 million visits per month, making it the fifth most-visited website in Indonesia. Twitter users exchange information with each other daily. One of them is a traffic accident event. With over 100,000 cases every year from 2017–2021, it is not usual to see a tweet that contains traffic accident information. By implementing text classification, traffic accidents can be detected through tweets and used to send alert messages to emergency responders to respond as quickly as possible. Previous research used a machine learning approach to solve this text classification problem. The study resulted in the best accuracy of 85% from the SVM model, which leaves room for improvement using state-of-the-art deep learning models. This research proposes a transfer learning method using two BERT-based and two RoBERTa-based pre-trained models, namely IndoBERT, IndoBERTweet, Indonesian RoBERTa Base Wiki, and Indonesian RoBERTa Base OSCAR to create the best model to classify tweets that contain traffic accident information. We used two kinds of fine-tuning architecture: the vanilla version fine-tuning architecture and the modified version, which combines the pre-trained model with CNN. This study used 1,002 manually labeled tweets, where 360 were labeled as traffic accident tweets. The experiment found that transfer learning from a pre-trained model Indonesian RoBERTa OSCAR provided the best result with an f1-score of 88.73 % and an accuracy of 92%, which means a 7% accuracy improvement over the previous research's best model.",
                "keywords": [
                    "Text Classification",
                    "Transfer Learning",
                    "BERT",
                    "RoBERTa",
                    "Traffic Accident",
                    "Tweet"
                ]
            },
            {
                "status": "Co-author",
                "url": "https://ieeexplore.ieee.org/document/10331336",
                "date": "September 2023",
                "title": "Improving Indonesian Informal to Formal Style Transfer via Pre-Training Unlabelled Augmented Data",
                "publisher": "IEEE Xplore",
                "abstract": "Neural Machine Translation is already used for Indonesian informal to formal style transfer. It works by translating the input language to the target language. In Indonesian informal-to-formal style transfer task, informal sentence work as an input language, and formal sentence is the target the model needs to translate to. Currently, the STIF parallel dataset is the only manually labelled informal-to-formal dataset. We need sufficient data to achieve a good model for style transfer performance. In contrast, the current Indonesian informal to formal dataset is insufficient. We adopted the pre-train augmentation architecture introduced by work done in GEC tasks to elevate the Low-Resource data. We create the augmented dataset with a simpler word replacement approach. We benchmark several transformer-based pre-trained model architectures, including BART, GPT2, and BERT Encoder Decoder. We train the augmented dataset to all models as a pre-trained model and fine-tune it with the STIF dataset. We perform the sacreBLEU benchmarking techniques to find which approach with better style transfer quality. The result is the BART model that was pre-trained with an augmented dataset and fine-tuned with the STIF dataset with a score of sacreBLEU 53,19.",
                "keywords": [
                    "style-transfer",
                    "Indonesia",
                    "pre-train",
                    "machine translation",
                    "semi-supervised",
                    "natural language processing"
                ]
            },
            {
                "status": "Co-author",
                "url": "https://prosiding.pnj.ac.id/index.php/sniv/article/view/385",
                "date": "August 2023",
                "title": "Perancangan Pemanfaatan Machine Learning untuk Deteksi Cacat Kemasan Produk",
                "publisher": "Seminar Nasional Inovasi Vokasi (SNIV)",
                "abstract": "Kemasan produk memainkan peran yang sangat penting dalam melindungi dan menjaga kualitas produk selama transportasi, penyimpanan, dan distribusi. Kemasan yang cacat atau rusak mengakibatkan produk menjadi rusak atau tidak terjual. Cacat pada kemasan dapat disebabkan oleh berbagai faktor, seperti ketidaksempurnaan produksi atau kerusakan selama pengangkutan. Deteksi cacat pada kemasan produk menjadi semakin penting karena semakin banyaknya permintaan konsumen untuk produk yang aman dan berkualitas tinggi. Saat ini deteksi cacat kemasan masih dilakukan secara manual dengan inspeksi visual buatan yang memiliki banyak kelemahan dan bersifat subjektif. Penelitian yang diusulkan bertujuan melakukan deteksi cacat kemasan produk memanfaatkan algoritma Machine Learning. Metode penelitian dimulai dari penggunaan dataset publik untuk produk kemasan industri yang berbentuk balok dengan menggunakan teknik pengolahan citra dan algoritma Machine Learning untuk pengenalan pola dan deteksi cacat kemasan. Beberapa penelitian sebelumnya telah dilakukan dan kebaharuan penelitian ini adalah algoritma machine learning dengan Deep Learning CNN agar mendapatkan akurasi yang lebih baik dan nilai error yang lebih kecil. Pada artikel ini telah dilakukan perancangan metode untuk melakukan deteksi cacat kemasan produk dan telah melakukan data preprocessing untuk dilanjutkan ke tahapan model deep learning yang akan diterapkan. Hasil penelitian diukur dengan menerapkan matriks confusion dibandingkan dengan hasil penelitian sebelumnya.",
                "keywords": [
                    "Kemasan Produk",
                    "Machine Learning",
                    "Deep Learning",
                    "Deteksi Cacat"
                ]
            }
        ]
    },
    "portfolio_page": {
        "categories": [
            "Artificial Intelligence",
            "Web Development"
        ],
        "portfolios": [
            {
                "name": "NyoalAI",
                "category": "Artificial Intelligence",
                "image": "./assets/images/portfolios/nyoal-ai.png",
                "url": "https://nyoal-ai.rizky-adi.my.id/",
                "description": "Fine-tuning BART and Flan-T5 implementation for Indonesian question and answer pair generation from text",
                "tech_stacks": [
                    "Docker",
                    "PyTorch",
                    "Hugging Face",
                    "Flask",
                    "FastAPI",
                    "Firebase"
                ]
            },
            {
                "name": "Alodokter Chatbot",
                "category": "Artificial Intelligence",
                "image": "./assets/images/portfolios/rag-alodokter.png",
                "url": "https://simple-rag-alodokter-gemini.streamlit.app/",
                "description": "Indonesian RAG chatbot implementation using Alodokter web data and Google Gemini",
                "tech_stacks": [
                    "Streamlit",
                    "Google Gemini"
                ]
            },
            {
                "name": "News Title Classifier",
                "category": "Artificial Intelligence",
                "image": "./assets/images/portfolios/news-title-classifier.png",
                "url": "https://indonesian-news-title-category-classifier.streamlit.app/",
                "description": "Word2vec, LSTM, and CNN implementation for Indonesian News Title Classification",
                "tech_stacks": [
                    "PyTorch",
                    "Streamlit"
                ]
            },
            {
                "name": "Food & Drink Description Generator",
                "category": "Artificial Intelligence",
                "image": "./assets/images/portfolios/food-drink-desc-generator.png",
                "url": "https://food-drink-description-generator-bahasa.streamlit.app/",
                "description": "LSTM and Fine-tuning GPT2 implementation for Indonesian Food & Drink Description Generation",
                "tech_stacks": [
                    "PyTorch",
                    "Hugging Face",
                    "Streamlit"
                ]
            },
            {
                "name": "SakubiAcademy",
                "category": "Web Development",
                "image": "./assets/images/portfolios/sakubiacademy.png",
                "url": "https://sakubiacademy.com",
                "description": "Elearning website for online course, build from scratch using Laravel",
                "tech_stacks": [
                    "Laravel",
                    "MySQL"
                ]
            },
            {
                "name": "Sakubi Elearning",
                "category": "Web Development",
                "image": "./assets/images/portfolios/elearning-sakubi.png",
                "url": "https://elearning.sakubiacademy.com",
                "description": "Moodle based elearning website for online course",
                "tech_stacks": [
                    "Moodle",
                    "MySQL"
                ]
            },
            {
                "name": "Sentiment Analysis",
                "category": "Artificial Intelligence",
                "image": "./assets/images/portfolios/sentiment-analysis.png",
                "url": "https://adirizq-sentiment-analysis-svm-app-7xmuj8.streamlit.app/",
                "description": "SVM implementation for Indonesian sentiment analysis",
                "tech_stacks": [
                    "Scikit-learn",
                    "Streamlit"
                ]
            }
        ]
    }
}